## Solar Predictions

In [6]:
import pandas as pd
import numpy as np
import math

In [7]:
demand_df = pd.read_csv('../Data/demand.csv')
solarval_df = demand_df.drop(['Building0','Building1','Building3','Building4','Building5', 'Building6'], axis = 1)
weather_df = pd.read_csv('../Data/weather.csv')
solarexp_df = weather_df[['Date','olympic_solar', 'oakleigh_solar', 'moorabbin_solar']]

In [8]:
solarval_df['Time'] = np.nan
solarval_df.loc[0,'Time'] = 20
solarval_df.head()

                  Date  Solar0  Solar1  Solar2  Solar3  Solar4  Solar5  Time
0  2016-07-03 21:30:00     NaN     NaN     NaN     NaN     NaN     NaN  20.0
1  2016-07-03 21:45:00     NaN     NaN     NaN     NaN     NaN     NaN   NaN
2  2016-07-03 22:00:00     NaN     NaN     NaN     NaN     NaN     NaN   NaN
3  2016-07-03 22:15:00     NaN     NaN     NaN     NaN     NaN     NaN   NaN
4  2016-07-03 22:30:00     NaN     NaN     NaN     NaN     NaN     NaN   NaN

In [9]:
i = 0

while i < 148810:  
    j = solarval_df.iat[i,0]
    solarval_df.loc[i,'Time'] = j[11:19]
    i+=1

In [10]:
i = 0 
while i < 148810:  
    j = solarval_df.iat[i,0]
    j = j[0:10]
    solarval_df.iat[i,0] = j
    i+=1

In [11]:
solarval_df.tail()

              Date  Solar0  Solar1  Solar2  Solar3  Solar4  Solar5      Time
148805  2020-09-30   29.67    6.68    6.34    5.49    4.55   25.28  22:45:00
148806  2020-09-30   29.94    6.71    6.39    5.65    4.57   25.30  23:00:00
148807  2020-09-30   34.02    8.13    7.71    6.83    5.32   28.62  23:15:00
148808  2020-09-30   38.10    9.55    9.03    8.02    6.08   31.94  23:30:00
148809  2020-09-30   39.88   10.12    9.67    8.62    6.33   32.92  23:45:00

In [12]:
solarmain_df = pd.merge(solarval_df, solarexp_df, how = 'inner')

solarmain_df.head()

,Date,Solar0,Solar1,Solar2,Solar3,Solar4,Solar5,Time,olympic_solar,oakleigh_solar,moorabbin_solar
0,2016-07-03,NaN,NaN,NaN,NaN,NaN,NaN,21:30:00,7.8,6.8,5.5
1,2016-07-03,NaN,NaN,NaN,NaN,NaN,NaN,21:45:00,7.8,6.8,5.5
2,2016-07-03,NaN,NaN,NaN,NaN,NaN,NaN,22:00:00,7.8,6.8,5.5
3,2016-07-03,NaN,NaN,NaN,NaN,NaN,NaN,22:15:00,7.8,6.8,5.5
4,2016-07-03,NaN,NaN,NaN,NaN,NaN,NaN,22:30:00,7.8,6.8,5.5

In [13]:
solarmain_df1 = solarmain_df[139000:140000]
math.isnan(solarmain_df1.iat[0,5])

False

In [14]:
type(solarmain_df1.iat[0,0]) == str

True

In [15]:
def removenull(df):
    rowsremove = []
    for i in range(len(df)): #go through each row
        for j in range(len(df.columns)): # go through each column
            if type(df.iat[i,j]) != str:
                rowsremove.append(i)
                if df.iat[i,j] <=1000:
                    if df.iat[i,j] >=0:
                        rowsremove.remove(i)
    rowsremove = list(dict.fromkeys(rowsremove))
    df.drop(rowsremove, axis = 0)
    return rowsremove

In [202]:
solarmain_df.iat[130000,2]

4.87

In [16]:
solarmain_df1

,Date,Solar0,Solar1,Solar2,Solar3,Solar4,Solar5,Time,olympic_solar,oakleigh_solar,moorabbin_solar
139000,2020-06-20,0.01,0.00,0.00,0.00,0.00,0.00,19:30:00,8.5,9.1,9.0
139001,2020-06-20,0.01,0.00,0.00,0.00,0.00,0.00,19:45:00,8.5,9.1,9.0
139002,2020-06-20,0.01,0.00,0.00,0.00,0.00,0.00,20:00:00,8.5,9.1,9.0
139003,2020-06-20,0.01,0.00,0.00,0.00,0.00,0.00,20:15:00,8.5,9.1,9.0
139004,2020-06-20,0.01,0.00,0.00,0.00,0.00,0.00,20:30:00,8.5,9.1,9.0
...,...,...,...,...,...,...,...,...,...,...,...
139995,2020-07-01,14.14,6.57,5.12,5.13,3.09,14.43,04:15:00,9.1,9.1,8.8
139996,2020-07-01,12.79,6.09,4.62,4.78,2.83,13.61,04:30:00,9.1,9.1,8.8
139997,2020-07-01,10.80,5.38,4.08,4.28,2.49,12.54,04:45:00,9.1,9.1,8.8
139998,2020-07-01,8.81,4.67,3.54,3.77,2.15,11.46,05:00:00,9.1,9.1,8.8
139999,2020-07-01,7.06,3.82,2.85,3.06,1.77,9.76,05:15:00,9.1,9.1,8.8

In [17]:
solarexp_df.iat[1790,0]

'2017-11-26'

In [18]:
removenull(solarexp_df)

[1790]

In [19]:
solarmain_df

,Date,Solar0,Solar1,Solar2,Solar3,Solar4,Solar5,Time,olympic_solar,oakleigh_solar,moorabbin_solar
0,2016-07-03,NaN,NaN,NaN,NaN,NaN,NaN,21:30:00,7.8,6.8,5.5
1,2016-07-03,NaN,NaN,NaN,NaN,NaN,NaN,21:45:00,7.8,6.8,5.5
2,2016-07-03,NaN,NaN,NaN,NaN,NaN,NaN,22:00:00,7.8,6.8,5.5
3,2016-07-03,NaN,NaN,NaN,NaN,NaN,NaN,22:15:00,7.8,6.8,5.5
4,2016-07-03,NaN,NaN,NaN,NaN,NaN,NaN,22:30:00,7.8,6.8,5.5
...,...,...,...,...,...,...,...,...,...,...,...
148805,2020-09-30,29.67,6.68,6.34,5.49,4.55,25.28,22:45:00,13.0,12.6,12.8
148806,2020-09-30,29.94,6.71,6.39,5.65,4.57,25.30,23:00:00,13.0,12.6,12.8
148807,2020-09-30,34.02,8.13,7.71,6.83,5.32,28.62,23:15:00,13.0,12.6,12.8
148808,2020-09-30,38.10,9.55,9.03,8.02,6.08,31.94,23:30:00,13.0,12.6,12.8
148809,2020-09-30,39.88,10.12,9.67,8.62,6.33,32.92,23:45:00,13.0,12.6,12.8

In [20]:
solarmain_df.drop(removenull(solarmain_df), axis = 0)

,Date,Solar0,Solar1,Solar2,Solar3,Solar4,Solar5,Time,olympic_solar,oakleigh_solar,moorabbin_solar
133602,2020-04-25,0.00,7.63,3.75,1.34,1.66,0.00,14:00:00,10.4,10.6,10.2
133603,2020-04-25,0.00,7.63,3.75,1.34,1.66,0.00,14:15:00,10.4,10.6,10.2
133604,2020-04-25,0.00,7.63,3.75,1.34,1.66,0.00,14:30:00,10.4,10.6,10.2
133605,2020-04-25,0.00,7.63,3.75,1.34,1.66,0.00,14:45:00,10.4,10.6,10.2
133606,2020-04-25,0.00,7.63,3.75,1.34,1.66,0.00,15:00:00,10.4,10.6,10.2
...,...,...,...,...,...,...,...,...,...,...,...
148805,2020-09-30,29.67,6.68,6.34,5.49,4.55,25.28,22:45:00,13.0,12.6,12.8
148806,2020-09-30,29.94,6.71,6.39,5.65,4.57,25.30,23:00:00,13.0,12.6,12.8
148807,2020-09-30,34.02,8.13,7.71,6.83,5.32,28.62,23:15:00,13.0,12.6,12.8
148808,2020-09-30,38.10,9.55,9.03,8.02,6.08,31.94,23:30:00,13.0,12.6,12.8
148809,2020-09-30,39.88,10.12,9.67,8.62,6.33,32.92,23:45:00,13.0,12.6,12.8

In [228]:
solarmain_df

,Date,Solar0,Solar1,Solar2,Solar3,Solar4,Solar5,Time,olympic_solar,oakleigh_solar,moorabbin_solar
139000,2020-06-20,0.01,0.00,0.00,0.00,0.00,0.00,19:30:00,8.5,9.1,9.0
139001,2020-06-20,0.01,0.00,0.00,0.00,0.00,0.00,19:45:00,8.5,9.1,9.0
139002,2020-06-20,0.01,0.00,0.00,0.00,0.00,0.00,20:00:00,8.5,9.1,9.0
139003,2020-06-20,0.01,0.00,0.00,0.00,0.00,0.00,20:15:00,8.5,9.1,9.0
139004,2020-06-20,0.01,0.00,0.00,0.00,0.00,0.00,20:30:00,8.5,9.1,9.0
...,...,...,...,...,...,...,...,...,...,...,...
139995,2020-07-01,14.14,6.57,5.12,5.13,3.09,14.43,04:15:00,9.1,9.1,8.8
139996,2020-07-01,12.79,6.09,4.62,4.78,2.83,13.61,04:30:00,9.1,9.1,8.8
139997,2020-07-01,10.80,5.38,4.08,4.28,2.49,12.54,04:45:00,9.1,9.1,8.8
139998,2020-07-01,8.81,4.67,3.54,3.77,2.15,11.46,05:00:00,9.1,9.1,8.8
139999,2020-07-01,7.06,3.82,2.85,3.06,1.77,9.76,05:15:00,9.1,9.1,8.8

In [21]:
solarmain_df.to_csv('solar.csv')